AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_СтатусыДоговоровНаПродажуАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыДоговоровНаПродажуАвтомобиля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИзменение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыРезервовАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыРезервовАвтомобилей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаРезерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервОтклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервСнят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыДокументаЗаписьНаВыдачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыДокументаЗаписьНаВыдачу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_РезервированиеАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_РезервированиеАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_УтвержденныеРезервы</xr:Item>
				<xr:Item>InformationRegister.Renault_ЗаявкиНаРезервАвтомобиля</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыРезервовАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SedreNum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Renault_ОбменВПределахДилераОтправка/Ext/Module.bsl
Процедура Обменяться() Экспорт
	
	ПланОбмена = ПолучитьПланОбмена();
	
	Если ЗначениеЗаполнено(ПланОбмена) тогда
		ВыполнитьОтправкуДанных(ПланОбмена);
	Иначе
		Renault_Открытый.СообщитьПользователю("Формирование отменено, не удалось определить план обмена");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПланОбмена()
		
	Выборка = ПланыОбмена.Renault_ОбменВПределахДилера.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_ОбменВПределахДилера.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьПрокси()
	
	Адрес = "http://gate.rnlt.ru/renault-ws-gate/ws/DealerExchange.1cws?wsdl";
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault.ru/WSGate/DealerExchange", 
		"Renault_DealerExchange",
		"Renault_DealerExchangeSoap",
		3600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	                         
КонецФункции

Процедура ВыполнитьОтправкуДанных(ПланОбмена) Экспорт
	
	ВебСервис = ПолучитьПрокси();
	
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	
	Server = СтрокаСоединенияИнформационнойБазы();
	BIR = Константы.Renault_BIR_db.Получить();

	Выборка = ПланыОбмена.ВыбратьИзменения(ПланОбмена, 2);
	
	//Посчитаем количество изменений
	ОбщееКоличество = 0;
	Пока Выборка.Следующий() Цикл
		ОбщееКоличество = ОбщееКоличество + 1;
	КонецЦикла;
	Выборка.Сбросить();
	
	//Заполним таблицы первоначальной информацией из плана обмена
	Счетчик = 0; ВсегоПередано = 0;
	БылоИзменениеОстатков = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если Счетчик = 0 Тогда
			ТаблицаДоговоры = ИнициализироватьТаблицуДоговоров();
			ТаблицаДоговоры_ДляУдаленияРегистрации = ТаблицаДоговоры.Скопировать();
			
			ТаблицаРезервы = ИнициализироватьТаблицуРезервов();
			ТаблицаРезервы_ДляУдаленияРегистрации = ТаблицаРезервы.Скопировать();
			
			ТаблицаВыдачи = ИнициализироватьТаблицуВыдачи();
			ТаблицаВыдачи_ДляУдаленияРегистрации = ТаблицаВыдачи.Скопировать();
		КонецЕсли;
		
		ЭлементИзмененныхДанных = Выборка.Получить();
		ДобавитьЭлементВТаблицуДляОтправки(ЭлементИзмененныхДанных, БылоИзменениеОстатков, 
			ТаблицаДоговоры, 				ТаблицаДоговоры_ДляУдаленияРегистрации,
			ТаблицаРезервы,					ТаблицаРезервы_ДляУдаленияРегистрации,
			ТаблицаВыдачи,					ТаблицаВыдачи_ДляУдаленияРегистрации);
		
		Счетчик = Счетчик + 1;
		ВсегоПередано = ВсегоПередано + 1;
		
		Если Счетчик = 10000 ИЛИ ВсегоПередано = ОбщееКоличество Тогда
			
			//Дозаполним таблицы информацией из базы
			ЗаполнитьТаблицуДоговоры(ТаблицаДоговоры, BIR);
			ЗаполнитьТаблицуРезервы(ТаблицаРезервы, BIR);
			ЗаполнитьТаблицуВыдачи(ТаблицаВыдачи, BIR);
			
			ОтправитьТаблицу("SetContracts", ТаблицаДоговоры, ТаблицаДоговоры_ДляУдаленияРегистрации, ВебСервис, Сериализатор, Server, BIR, ПланОбмена);
			ОтправитьТаблицу("ЗагрузитьРезервы", ТаблицаРезервы, ТаблицаРезервы_ДляУдаленияРегистрации, ВебСервис, Сериализатор, Server, BIR, ПланОбмена);
			ОтправитьТаблицу("ЗагрузитьВыдачи", ТаблицаВыдачи, ТаблицаВыдачи_ДляУдаленияРегистрации, ВебСервис, Сериализатор, Server, BIR, ПланОбмена);
			Если ВсегоПередано = ОбщееКоличество Тогда
				ОтправитьТаблицуОстатков(ВебСервис, Сериализатор, Server, BIR, ПланОбмена, БылоИзменениеОстатков);
			КонецЕсли;
			
			Счетчик = 0;
			
		КонецЕсли;
		
	КонецЦикла;                      
		
КонецПроцедуры

Процедура ОтправитьТаблицу(Команда, Таблица, Таблица_ДляУдаленияРегистрации, ВебСервис, Сериализатор, Server, BIR, ПланОбмена)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
			
	СериализованнаяТаблица = Сериализатор.ЗаписатьXDTO(Таблица);
	ДанныеОтправлены = ВебСервис.SetDataFromDealerToServer(Команда, СериализованнаяТаблица, Server);
	
	Если ДанныеОтправлены Тогда
		ОтменитьРегистрациюСправочника(Таблица_ДляУдаленияРегистрации, ПланОбмена);
	КонецЕсли;
					
КонецПроцедуры

Процедура ОтправитьТаблицуОстатков(ВебСервис, Сериализатор, Server, BIR, ПланОбмена, БылоИзменениеОстатков)
	
	Если Не БылоИзменениеОстатков Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&BIR КАК ИдентификаторИБ,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Наименование КАК Склад
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки";
	Запрос.УстановитьПараметр("BIR", BIR);
	Таблица = Запрос.Выполнить().Выгрузить();
	ДополнитьТаблицуДанныхУИДами(Таблица);
			
	СериализованнаяТаблица = Сериализатор.ЗаписатьXDTO(Таблица);
	ДанныеОтправлены = ВебСервис.SetDataFromDealerToServer("ЗагрузитьОстатки", СериализованнаяТаблица, Server);
	
	Если ДанныеОтправлены Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, Метаданные.РегистрыНакопления.ОстаткиАвтомобилей);
	КонецЕсли;
					
КонецПроцедуры

Процедура ОтменитьРегистрациюСправочника(ТаблицаОписание, ПланОбмена)

	Для Каждого КлючевыеПоля из ТаблицаОписание Цикл
		
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, КлючевыеПоля.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДоговоры(ТаблицаДоговоры, BIR)
	
	Если ТаблицаДоговоры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Ссылка,
		|	Данные.УдаленнаяЗапись
		|ПОМЕСТИТЬ ВтДанные
		|ИЗ
		|	&Таблица КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&BIR КАК ИдентификаторИБ,
		|	Renault_Договор.Дата,
		|	Renault_Договор.ПометкаУдаления,
		|	Данные.Ссылка,
		|	Renault_Договор.ДилерскийЦентр.Наименование КАК ДилерскийЦентр,
		|	Данные.УдаленнаяЗапись КАК УдаленнаяЗапись,
		|	Renault_Договор.СоставДоговора.(
		|		VIN
		|	),
		|	Renault_Договор.РабочийЛист,
		|	Renault_Договор.Проведен,
		|	ВЫБОР
		|		КОГДА (Renault_Договор.СтатусПредварительныхДокументов = &СтатусРезерва
		|				ИЛИ Renault_Договор.СтатусОкончательныхДокументов = &СтатусРезерва)
		|				И Renault_Договор.СтатусДоговора <> ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Расторгнут)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Резерв,
		|	""Контракт"" КАК Тип_,
		|	Renault_Договор.Менеджер.Наименование КАК Менеджер
		|ИЗ
		|	ВтДанные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_Договор КАК Renault_Договор
		|		ПО Данные.Ссылка = Renault_Договор.Ссылка";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДоговоры);
	Запрос.УстановитьПараметр("BIR", BIR);
	Запрос.УстановитьПараметр("СтатусРезерва", Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Подписан);
	ТаблицаДоговоры = Запрос.Выполнить().Выгрузить();
	ДополнитьТаблицуДанныхУИДами(ТаблицаДоговоры);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуРезервы(Таблица, BIR)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Ссылка,
		|	Данные.УдаленнаяЗапись
		|ПОМЕСТИТЬ ВтДанные
		|ИЗ
		|	&Таблица КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&BIR КАК ИдентификаторИБ,
		|	Renault_РезервированиеАвтомобилей.Дата,
		|	Renault_РезервированиеАвтомобилей.ПометкаУдаления,
		|	Данные.Ссылка,
		|	Renault_РабочиеЛисты.ДилерскийЦентр.Наименование КАК ДилерскийЦентр,
		|	Данные.УдаленнаяЗапись КАК УдаленнаяЗапись,
		|	Renault_РезервированиеАвтомобилей.VIN,
		|	Renault_РезервированиеАвтомобилей.РабочийЛист,
		|	Renault_РезервированиеАвтомобилей.Проведен,
		|	ВЫБОР
		|		КОГДА Renault_РезервированиеАвтомобилей.СтатусРезерва = ЗНАЧЕНИЕ(ПеречислениЕ.CRM_СтатусыРезервовАвтомобилей.РезервУтвержден)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Резерв,
		|	""Резерв"" КАК Тип_,
		|	Renault_РабочиеЛисты.Сотрудник.Наименование КАК Менеджер
		|ИЗ
		|	ВтДанные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РезервированиеАвтомобилей КАК Renault_РезервированиеАвтомобилей
		|		ПО Данные.Ссылка = Renault_РезервированиеАвтомобилей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|		ПО (Renault_РабочиеЛисты.IDK = Renault_РезервированиеАвтомобилей.РабочийЛист)";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("BIR", BIR);
	Таблица = Запрос.Выполнить().Выгрузить();
	ДополнитьТаблицуДанныхУИДами(Таблица);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуВыдачи(Таблица, BIR)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Ссылка,
		|	Данные.УдаленнаяЗапись
		|ПОМЕСТИТЬ ВтДанные
		|ИЗ
		|	&Таблица КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&BIR КАК ИдентификаторИБ,
		|	CRM_ЗаписьНаВыдачу.Дата,
		|	CRM_ЗаписьНаВыдачу.ПометкаУдаления,
		|	Данные.Ссылка,
		|	Renault_РабочиеЛисты.ДилерскийЦентр.Наименование КАК ДилерскийЦентр,
		|	Данные.УдаленнаяЗапись КАК УдаленнаяЗапись,
		|	CRM_ЗаписьНаВыдачу.IDK КАК РабочийЛист,
		|	CRM_ЗаписьНаВыдачу.Проведен,
		|	ВЫБОР
		|		КОГДА CRM_ЗаписьНаВыдачу.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Резерв,
		|	CRM_ЗаписьНаВыдачу.АвтомобилиДляВыдачи.(
		|		VIN
		|	) КАК Автомобили,
		|	""Выдача"" КАК Тип_,
		|	Renault_РабочиеЛисты.Сотрудник.Наименование КАК Менеджер
		|ИЗ
		|	ВтДанные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
		|		ПО Данные.Ссылка = CRM_ЗаписьНаВыдачу.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|		ПО (Renault_РабочиеЛисты.IDK = CRM_ЗаписьНаВыдачу.IDK)";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("BIR", BIR);
	Таблица = Запрос.Выполнить().Выгрузить();
	ДополнитьТаблицуДанныхУИДами(Таблица);
	
КонецПроцедуры

//Проверяем по названию колонки  нужно ли получать УИД для значения в ней
Функция ЭтоКолонкаДляУИД(ИмяКолонки)
	
	Если ТипЗнч(ИмяКолонки) = Тип("Строка") Тогда
		
		Поиск = Найти(ИмяКолонки, "Ссылка");
		Возврат ?(Поиск > 0 , Истина, Ложь);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

//Получаем имя колонки куда надо записать УИД
Функция ИмяДляКолонкиУИД(ИмяКолонкиИсточника)
	
	Если ТипЗнч(ИмяКолонкиИсточника) = Тип("Строка") Тогда
		
		Ответ = "UID" + СтрЗаменить(ИмяКолонкиИсточника, "Ссылка", "");
		Возврат Ответ;
		
	Иначе
		
		Возврат "UID";
		
	КонецЕсли;
	
КонецФункции

//Добавим нужные колонки,заполним их УИДами,удалим колонки с ссылками 
Процедура ДополнитьТаблицуДанныхУИДами(ТаблицаДанных)Экспорт
	
	//Определим колонки с ссылочными данными (в названии содержится ссылка)
	
	КолонкиДляУид = Новый Массив();
	
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
		
		Если ЭтоКолонкаДляУИД(Колонка.Имя) тогда
			
			КолонкиДляУид.Добавить(Колонка.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Добавляем колонки для идентификаторов
	
	Для Каждого КолонкаВУИД Из КолонкиДляУид Цикл
		
		ТаблицаДанных.Колонки.Добавить(ИмяДляКолонкиУИД(КолонкаВУИД),Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(40)));
		
	КонецЦикла;
	
	//Заполним колонки с идентификаторами данными
	
	Для Каждого Тек Из ТаблицаДанных Цикл
		
		Для Каждого КолонкаВУИД из КолонкиДляУид Цикл
			
			Если ЗначениеЗаполнено(Тек[КолонкаВУИД]) Тогда
				
				Тек[ИмяДляКолонкиУИД(КолонкаВУИД)] = Тек[КолонкаВУИД].Ссылка.УникальныйИдентификатор();
				
			Иначе
				
				//Тек[ИмяДляКолонкиУИД(КолонкаВУИД)] ="-1";
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Удалим старые колонки с ссылочными данными
	
	Для каждого КолонкаВУИД Из КолонкиДляУид Цикл
		
		ТаблицаДанных.Колонки.Удалить(КолонкаВУИД);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИнициализироватьТаблицуДоговоров()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_Договор.Ссылка,
		|	ЛОЖЬ КАК УдаленнаяЗапись
		|ИЗ
		|	Документ.Renault_Договор КАК Renault_Договор";
	Таблица = Запрос.Выполнить().Выгрузить();			   
	Таблица.Очистить();
	Возврат Таблица;
	
КонецФункции

Функция ИнициализироватьТаблицуРезервов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_РезервированиеАвтомобилей.Ссылка,
		|	ЛОЖЬ КАК УдаленнаяЗапись
		|ИЗ
		|	Документ.Renault_РезервированиеАвтомобилей КАК Renault_РезервированиеАвтомобилей";
	Таблица = Запрос.Выполнить().Выгрузить();			   
	Таблица.Очистить();
	Возврат Таблица;
	
КонецФункции

Функция ИнициализироватьТаблицуВыдачи()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_ЗаписьНаВыдачу.Ссылка,
		|	ЛОЖЬ КАК УдаленнаяЗапись
		|ИЗ
		|	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу";
	Таблица = Запрос.Выполнить().Выгрузить();			   
	Таблица.Очистить();
	Возврат Таблица;
	
КонецФункции

Процедура ДобавитьЭлементВТаблицуДляОтправки(ЭлементИзмененныхДанных, БылоИзменениеОстатков,
			ТаблицаДоговоры, 				ТаблицаДоговоры_ДляУдаленияРегистрации,
			ТаблицаРезервы,					ТаблицаРезервы_ДляУдаленияРегистрации,
			ТаблицаВыдачи,					ТаблицаВыдачи_ДляУдаленияРегистрации)
			
	Если ТипЗнч(ЭлементИзмененныхДанных) =  Тип("УдалениеОбъекта") Тогда
		
		Если ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("ДокументСсылка.Renault_Договор") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаДоговоры, ТаблицаДоговоры_ДляУдаленияРегистрации);			
		ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("ДокументСсылка.Renault_РезервированиеАвтомобилей") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаРезервы, ТаблицаРезервы_ДляУдаленияРегистрации);			
		ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных.Ссылка) = Тип("ДокументСсылка.CRM_ЗаписьНаВыдачу") Тогда
			ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаВыдачи, ТаблицаВыдачи_ДляУдаленияРегистрации);			
		КонецЕсли;
				
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("ДокументОбъект.Renault_Договор") Тогда		
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаДоговоры, ТаблицаДоговоры_ДляУдаленияРегистрации);	
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("ДокументОбъект.Renault_РезервированиеАвтомобилей") Тогда		
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаРезервы, ТаблицаРезервы_ДляУдаленияРегистрации);	
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("ДокументОбъект.CRM_ЗаписьНаВыдачу") Тогда		
		ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, ТаблицаВыдачи, ТаблицаВыдачи_ДляУдаленияРегистрации);	
	ИначеЕсли ТипЗнч(ЭлементИзмененныхДанных) =  Тип("РегистрНакопленияНаборЗаписей.ОстаткиАвтомобилей") Тогда
		БылоИзменениеОстатков = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьУдалениеСсылочногоТипа(ЭлементИзмененныхДанных, Таблица, Таблица_ДляУдаленияРегистрации)
	
	Стр = Таблица.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	Стр.УдаленнаяЗапись = Истина;
	
	Стр = Таблица_ДляУдаленияРегистрации.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	
КонецПроцедуры

Процедура ДобавитьИзменениеСсылочногоТипа(ЭлементИзмененныхДанных, Таблица, Таблица_ДляУдаленияРегистрации)
	
	Стр = Таблица.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	Стр.УдаленнаяЗапись = Ложь;
	
	Стр = Таблица_ДляУдаленияРегистрации.Добавить();
	Стр.Ссылка = ЭлементИзмененныхДанных.Ссылка;
	
КонецПроцедуры
